/** @see https://developer.mozilla.org/zh-CN/docs/Web/API/WebGL_API/Tutorial/Creating_3D_objects_using_WebGL */

/**
  *  每三个数字一组构成一个点, 每四个点形成每一个面
  *  4 * 6 = 24 组坐标
  */
const vertices = [
  /** [ 📒 x, y, z ]
   *  WebGL 采用右手坐标系, 大拇指, 食指, 中指依次为 x, y, z 轴
   *  z 轴以屏幕外为正方向
   */

  /**
   * Q: 立方体的每个顶点被 3 个面公用, 使用8个顶点就好了，为什么要使用24个顶点呢?
   * A: 每个顶点虽然被3个面共享, 但是它在每个面上需要使用不同的颜色信息。
   *    24 个顶点中的每一个都会有独立的颜色信息，这就会造成每个顶点位置都会有 3 份副本。
   */

  /** Front face */
 -1.0, -1.0,  1.0,  // 0, B
  1.0, -1.0,  1.0,  // 1, C
  1.0,  1.0,  1.0,  // 2, D
 -1.0,  1.0,  1.0,  // 3, E

  /** Back face, 相较上一组, z 轴全部反转 */
 -1.0, -1.0, -1.0,  // 4, A
 -1.0,  1.0, -1.0,  // 5, F
  1.0,  1.0, -1.0,  // 6, G
  1.0, -1.0, -1.0,  // 7, H

  /** Top face */
 -1.0,  1.0, -1.0,  // 8,  F
 -1.0,  1.0,  1.0,  // 9,  E
  1.0,  1.0,  1.0,  // 10, D
  1.0,  1.0, -1.0,  // 11, G

  /** Bottom face, 相较上一组, y 轴全部反转 */
 -1.0, -1.0, -1.0,  // 12, A
 -1.0, -1.0,  1.0,  // 13, B
  1.0, -1.0,  1.0,  // 14, C
  1.0, -1.0, -1.0,  // 15, H

  /** Right face */
  1.0, -1.0, -1.0,   // 16, H
  1.0,  1.0, -1.0,   // 17, G
  1.0,  1.0,  1.0,   // 18, D
  1.0, -1.0,  1.0,   // 19, C

  /** Left face */
 -1.0, -1.0, -1.0,   // 20, A
 -1.0, -1.0,  1.0,   // 21, B
 -1.0,  1.0,  1.0,   // 22, E
 -1.0,  1.0, -1.0,   // 23, F
];

/**
 *    FRONT          BACK
 *    3 <- *  2      5 <— *  6
 *    ↓ ↗    *      ↑ ↙    *
 *    *    ↙ ↑      *    ↗ ↓
 *    0  * -> 1      4  * <- 7
 *
 *    TOP            BOTTOM
 *    9 -> *  10     13—> *  14
 *    ↑ ↙    *      ↑ ↙    *
 *    *    ↗ ↓      *    ↗ ↓
 *    8  * <- 11     12 * <- 15
 *
 *    RIGHT            LEFT
 *    9 -> *  10     5 <— *  6
 *    ↑ ↙    *      ↑ ↙    *
 *    *    ↙ ↑      *    ↗ ↓
 *    8  * -> 11     4  * <- 7
 */

const vertexIndices = [
    0,  1,  2,      0,  2,  3,     // front
    4,  5,  6,      4,  6,  7,     // back
    8,  9,  10,     8,  10, 11,    // top
    12, 13, 14,     12, 14, 15,    // bottom
    16, 17, 18,     16, 18, 19,    // right
    20, 21, 22,     20, 22, 23,    // left
]

const colors = [
  [1.0,  0.0,  0.0,  1.0],    // Front face: R
  [0.0,  1.0,  0.0,  1.0],    // Back face: G
  [0.0,  0.0,  1.0,  1.0],    // Top face: B
  [0.0,  1.0,  1.0,  1.0],    // Bottom face: GB
  [1.0,  0.0,  1.0,  1.0],    // Right face: RB
  [1.0,  1.0,  0.0,  1.0],    // Left face: RG
]
let vertexColors = [];
for (let face = 0; face < 6; face++) {
  for (let vertex = 0; vertex < 4; vertex++) {
    // same face, same color
    vertexColors = vertexColors.concat(colors[face]);
  }  
}
export { 
  vertexIndices, vertexColors, vertices,
}